[
  {
    "title": "ServerFire",
    "websites": ["GitHub"],
    "status": "Maintained",
    "types": ["Software"],
    "langs": [
      "JavaScript",
      "Node.js"
    ],
    "thumbnail": "/assets/npm-logo.webp",
    "description": "ServerFire is a lightweight JavaScript server framework that is 100% modular and a seventh the size of the leading Node.js server library, Express!\n\nDesigned to have zero external dependencies, the library is relatively simple, but its modular middleware system enables infinite possibilities! It is largely inspired by Express, since it was designed as a lightweight alternative with a relatively flat learning curve, and does use a list of file type indicators from ~$[sindresorhus](https://github.com/sindresorhus)'s NPM package, ~$[file-type](https://github.com/sindresorhus/file-type), which is linked in a comment in the corresponding code, but everything else, and the simplifications of the code used as inspiration, was made by me.\n\nServerFire originally began as a web server library called ~$[ServerLight](https://github.com/AmazingMech2418/ServerLight), which I made as a solution to Express' large file size, which was clogging the storage on my Repl.it account. I started using it for websites I made, but realized I needed to be able to do more, so I started working on a new library, which I called AdminServer. It was designed to be like Express, but less bulky and with built-in middlewares for website management. And eventually, when I got tired of copying dozens of files between projects each time I used it, I wanted to publish it to NPM as well! However, \"AdminServer\" was too close to an existing name, so I renamed it as ServerFire! Since then, I have worked on this package and improved it, and soon, ServerFire 2.0 will come out, with more powerful features and an even more lightweight codebase!",
    "links": [
      {
        "label": "GitHub Repository: ",
        "url": "https://github.com/AmazingMech2418/ServerFire"
      },
      {
        "label": "NPM Package: ",
        "url": "https://npmjs.com/package/serverfire"
      },
      {
        "label": "Repl.it Demo: ",
        "url": "https://replit.com/@AmazingMech2418/ServerFire"
      },
      {
        "label": "Demo Website: ",
        "url": "https://serverfire.amazingmech2418.repl.co/"
      }
    ],
    "images": ["/assets/serverfire/demosite.png", "/assets/serverfire/npmpage.png"],
    "score": 100
  }
]
