[
  {
    "title": "ServerFire",
    "websites": ["GitHub"],
    "status": "Maintained",
    "types": ["Software"],
    "langs": [
      "JavaScript",
      "Node.js"
    ],
    "thumbnail": "/assets/npm-logo.png",
    "description": "ServerFire is a lightweight JavaScript server framework that is 100% modular and a seventh the size of the leading Node.js server library, Express!\n\nDesigned to have zero external dependencies, the library is relatively simple, but its modular middleware system enables infinite possibilities! It is largely inspired by Express, since it was designed as a lightweight alternative with a relatively flat learning curve, and does use a list of file type indicators from ~$[sindresorhus](https://github.com/sindresorhus)'s NPM package, ~$[file-type](https://github.com/sindresorhus/file-type), which is linked in a comment in the corresponding code, but everything else, and the simplifications of the code used as inspiration, was made by me.\n\nServerFire originally began as a web server library called ~$[ServerLight](https://github.com/AmazingMech2418/ServerLight), which I made as a solution to Express' large file size, which was clogging the storage on my Repl.it account. I started using it for websites I made, but realized I needed to be able to do more, so I started working on a new library, which I called AdminServer. It was designed to be like Express, but less bulky and with built-in middlewares for website management. And eventually, when I got tired of copying dozens of files between projects each time I used it, I wanted to publish it to NPM as well! However, \"AdminServer\" was too close to an existing name, so I renamed it as ServerFire! Since then, I have worked on this package and improved it, and soon, ServerFire 2.0 will come out, with more powerful features and an even more lightweight codebase!",
    "links": [
      {
        "label": "GitHub Repository: ",
        "url": "https://github.com/AmazingMech2418/ServerFire"
      },
      {
        "label": "NPM Package: ",
        "url": "https://npmjs.com/package/serverfire"
      },
      {
        "label": "Repl.it Demo: ",
        "url": "https://replit.com/@AmazingMech2418/ServerFire"
      },
      {
        "label": "Demo Website: ",
        "url": "https://serverfire.amazingmech2418.repl.co/"
      }
    ],
    "images": ["/assets/serverfire/demosite.png", "/assets/serverfire/npmpage.png"],
    "score": 100
  },
  {
    "title": "Self-XSS Protection Feature",
    "websites": ["GitHub"],
    "status": "Maintained",
    "types": ["Software"],
    "langs": [
      "JavaScript"
    ],
    "thumbnail": "/assets/github-logo.png",
    "description": "Too often, people run code themselves (through the JavaScript console, bookmarklets, or by pressing XSS-infected buttons or links) that contains malicious HTTP requests, such as cookie grabbers or malicious in-site endpoints, to obtain access to user accounts. Or even, there is simply an XSS vulnerability in the website that enables code to be run regardless of how careful the user is. Most of the harm is when a request is made without the user's knowledge. This script enables the user to know what requests are being made and to decide whether or not to allow them.\n\nThis Self-XSS Protection script is a single-file script that can be added into any website to improve security for users. The owner of the website just needs to update the script to allow certain endpoints, using the documentation in the GitHub repository, and when any non-native request is made, the user will see an alert box to confirm or deny the request. If confirmed, similar requests will always be allowed, but if denied, the request will be blocked.\n\nThis project started due to a discussion on the ~$[Scratch forums](https://scratch.mit.edu/discuss) about the potential banning of sharing bookmarklets. As a maker of many bookmarklets, I suggested that instead of banning them, a new security feature be implemented to prevent their dangers while maintaining their functionality. Then, I created this GitHub repository! After making this, I talked to ~$[@Paddle2See](https://scratch.mit.edu/users/Paddle2See), a Scratch Team member, to ask about its potential implementation, and he discussed it with the engineering team. Unfortunately, the idea was rejected due to the overhead required to implement the script on every page, but I still maintain this project as a security feature open to use on other websites!",
    "links": [
      {
        "label": "GitHub Repository: ",
        "url": "https://github.com/AmazingMech2418/Self-XSS-Protection"
      },
      {
        "label": "Repl.it Demo: ",
        "url": "https://replit.com/@AustinStitz/XSS-Protection-Demo"
      },
      {
        "label": "Demo Website: ",
        "url": "https://xss-protection-demo.austinstitz.repl.co/"
      }
    ],
    "images": ["/assets/xss/xssdemo.png", "/assets/xss/xssrepo.png"],
    "score": 100
  },
  {
    "title": "Space Observatory",
    "websites": ["Unpublished"],
    "status": "Abandoned",
    "types": ["Software"],
    "langs": [
      "Python",
      "JavaScript",
      "Bash",
      "HTML"
    ],
    "thumbnail": "/assets/observatory/nasa-logo.webp",
    "description": "Between 8th and 9th grade, I wanted to be able to track all things NASA, and made this project! Some parts, such as RSS feeds and podcasts, still work, but some also use APIs that have become obsolete. The project is partially broken, but since I plan to make a more modular version eventually anyways, and have learned much more since making this about server-client communications, I will not continue to update this project and plan to create a new dashboard application that will do the same things as this!",
    "links": [
      {
        "label": "GitHub Repository: ",
        "url": "https://github.com/AustinMichael2418/Space-Observatory"
      },
      {
        "label": "Repl.it Demo: ",
        "url": "https://replit.com/@AustinStitz/Space-Observatory"
      },
      {
        "label": "Demo Website: ",
        "url": "https://space-observatory.austinstitz.repl.co/"
      }
    ],
    "images": ["/assets/observatory/observatory-main.png", "/assets/observatory/spacex.png", "/assets/observatory/nasa-live.png", "/assets/observatory/nasa-podcast.png", , "/assets/observatory/nasa-rss.png"],
    "score": 50
  }
]
